public-db-soap-client/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:head="http://apache.org/headers" xmlns:ser="http://service.kndcrlts.crlts.cha/">
   <soapenv:Header>
      <head:ComMsgHeader>
         <RequestMsgID>netinamu42</RequestMsgID>
         <ServiceKey>J0dBIBcUMESTQ7Rs7bt4U+AMcATmUzND5pvbuT3u7LLSY1Qy0AwcZFgtFNuEtkFoE7Xb6WlA1pionwBEYCsJiQ==</ServiceKey>
       <!-- 
         <RequestTime></RequestTime>
         <CallBackURI></CallBackURI> -->
      </head:ComMsgHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getAgeCrltsList>
         <!--Optional:-->
         <arg0>
           <itemCd>20</itemCd>
         </arg0>
      </ser:getAgeCrltsList>
   </soapenv:Body>
</soapenv:Envelope>